(docs) Project Documentation and Instructions
